In [1]:
import pandas as pd
import numpy as np

In [2]:
test_df=pd.read_csv('test.csv')

In [3]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
test_df.shape

(418, 11)

In [5]:
test_df.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [6]:
test_df1=test_df.copy()

In [7]:
test_df1.drop('Cabin',axis=1,inplace=True)

In [8]:
test_df['Fare'].describe()

count    417.000000
mean      35.627188
std       55.907576
min        0.000000
25%        7.895800
50%       14.454200
75%       31.500000
max      512.329200
Name: Fare, dtype: float64

In [9]:
test_df['Fare'].value_counts()

7.7500      21
26.0000     19
8.0500      17
13.0000     17
7.8958      11
            ..
31.6833      1
16.0000      1
53.1000      1
146.5208     1
20.2500      1
Name: Fare, Length: 169, dtype: int64

In [10]:
test_df['Age'].describe()

count    332.000000
mean      30.272590
std       14.181209
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       76.000000
Name: Age, dtype: float64

In [11]:
test_df1['Age_Class']=((test_df1['Age']//10)*10).astype('object')

In [12]:
test_df1['Age_Class'].value_counts()

20.0    124
30.0     65
40.0     46
10.0     41
50.0     22
0.0      20
60.0     13
70.0      1
Name: Age_Class, dtype: int64

In [13]:
test_df1['Age_Class'].fillna(test_df1['Age_Class'].mode()[0],inplace=True)

In [14]:
test_df1.isna().sum()

PassengerId     0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            1
Embarked        0
Age_Class       0
dtype: int64

In [15]:
test_df1['Fare'].fillna(test_df1['Fare'].mean(),inplace=True)

In [16]:
test_df1.isna().sum()

PassengerId     0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            0
Embarked        0
Age_Class       0
dtype: int64

In [17]:
test_df1.drop('Age',axis=1,inplace=True)

In [18]:
test_df1.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Age_Class      0
dtype: int64

In [19]:
test_df1.shape

(418, 10)

In [20]:
test_df1.drop(['PassengerId','Name'],axis=1,inplace=True)

In [21]:
test_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Pclass     418 non-null    int64
 1   Sex        418 non-null    object
 2   SibSp      418 non-null    int64
 3   Parch      418 non-null    int64
 4   Ticket     418 non-null    object
 5   Fare       418 non-null    float64
 6   Embarked   418 non-null    object
 7   Age_Class  418 non-null    float64
dtypes: float64(2), int64(3), object(3)
memory usage: 26.2+ KB

In [22]:
test_df1['Pclass']=test_df1['Pclass'].astype('object')
test_df1['SibSp']=test_df1['SibSp'].astype('object')
test_df1['Parch']=test_df1['Parch'].astype('object')
test_df1['Age_Class']=test_df1['Age_Class'].astype('object')

In [23]:
test_df1.drop('Ticket',axis=1,inplace=True)

In [24]:
test_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Pclass     418 non-null    object
 1   Sex        418 non-null    object
 2   SibSp      418 non-null    object
 3   Parch      418 non-null    object
 4   Fare       418 non-null    float64
 5   Embarked   418 non-null    object
 6   Age_Class  418 non-null    object
dtypes: float64(1), object(6)
memory usage: 23.0+ KB

In [25]:
test_df1.shape

(418, 7)

In [26]:
#test_df2=test_df1[test_df1['Sex']=='female']

In [27]:
#test_df2.head()

In [28]:
#test_df2.drop('Sex',axis=1,inplace=True)

In [30]:
test_df1.to_csv('formulatedtest_Titanic.csv',index=False)